Управление_торговлей.ПБТ/src/Documents/ТребованияККачествуЗакупаемогоТовара/ТребованияККачествуЗакупаемогоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТребованияККачествуЗакупаемогоТовара</name>
  <registerRecords>InformationRegister.НормативыНоменклатурыЛаб</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСырья</name>
    <type>
      <types>CatalogRef.ВидыСырья</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставАнгл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеДляВидаСырья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОКК</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОККЗаАнализРазногласий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаЦИРПоРазногласиямЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаОККПоРазногласиямЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АллергеныЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияТребований</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеНеобходимо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РН</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураПоставщика</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>История</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаботаЦПБЗавершена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РаботаОККЗавершена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПищеваяЦенность</name>
    <attributes>
      <name>Ценность</name>
      <type>
        <types>CatalogRef.ПищевыеЦенности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеРегламенты</name>
    <attributes>
      <name>ПродуктУпаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Регламент</name>
      <type>
        <types>CatalogRef.ТехническиеРегламенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодИсследования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяОтНасНачальные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСравнения</name>
      <type>
        <types>EnumRef.ВариантыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Интервал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Любая дополнительная информация</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтНасАнглийский</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяАнглийский</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеВыводитьВСпецификации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяОтПоставщикаНачальные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяКонечные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КтоВнес</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КогдаВнес</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтличаетсяОтТР_ТС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьСторонняя</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНорматива</name>
      <type>
        <types>CatalogRef.ХарактеристикиНормативов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/InformationRegisters/НормативыНоменклатурыЛаб/НормативыНоменклатурыЛаб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативыНоменклатурыЛаб</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВариантСравнения</name>
    <type>
      <types>EnumRef.ВариантыСравнения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Интервал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>наАнглийскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокСл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеОтклонение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьЛаб</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеВыводитьВУК</name>
    <comment>0013660</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УсловияПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНорматива</name>
    <type>
      <types>CatalogRef.ХарактеристикиНормативов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/Enums/СтатусЗаявки/СтатусЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаявки</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ОРПоказателиКачества</name>
  </enumValues>
  <enumValues>
    <name>ТребованияСформированы</name>
  </enumValues>
  <enumValues>
    <name>ОККПоказателиБезопасности</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Разногласия</name>
  </enumValues>
  <enumValues>
    <name>ОтказСотрудничатьСПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>АнализОКК</name>
  </enumValues>
  <enumValues>
    <name>ПоставщикуНаПодпись</name>
  </enumValues>
  <enumValues>
    <name>ГДНаПодпись</name>
  </enumValues>
  <enumValues>
    <name>Периодичность</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Documents/ТребованияККачествуЗакупаемогоТовара/ObjectModule.bsl
Перем СообщениеОбИзменениях  Экспорт;
Перем ПредРаботаЦПБЗавершена;  //0021215
Перем ПредРаботаОККЗавершена;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЭтоНовый() Тогда
			Дата = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;  
	
	////определяем изменения в документе
	//СообщениеОбИзменениях = "";
	//ТекСообщ = "";
	//Для каждого Стр Из ТЧ_Показатели Цикл
	//	Если Ссылка.ТЧ_Показатели.Количество()>=Стр.НомерСтроки Тогда
	//		СтрСсылка = Ссылка.ТЧ_Показатели.Получить(Стр.НомерСтроки-1);
	//		ТекСообщ = "";
	//		Если Стр.Показатель <> СтрСсылка.Показатель Тогда
	//			ТекСообщ = ТекСообщ + "Изменился вид показателя: был "+СтрСсылка.Показатель+" стал "+ Стр.Показатель+Символы.ПС;
	//		КонецЕсли; 
	//		Если Стр.ЗначениеПоказателяОтНасНачальные <> СтрСсылка.ЗначениеПоказателяОтНасНачальные Тогда
	//			ТекСообщ = ТекСообщ + "Изменилось значение показателя: было "+СтрСсылка.ЗначениеПоказателя+" стало "+ Стр.ЗначениеПоказателя+Символы.ПС;
	//		КонецЕсли;
	//	Иначе	
	//		ТекСообщ = ТекСообщ + "Добавили вид показателя: "+ Стр.Показатель+Символы.ПС;
	//	КонецЕсли; 
	//	//если были изменения в этой строке - вставляем номер строки
	//	Если НЕ ТекСообщ = "" Тогда
	//		ТекСообщ = "Изменения в строке "+Стр.НомерСтроки+Символы.ПС+ТекСообщ;
	//		СообщениеОбИзменениях = Символы.ПС+СообщениеОбИзменениях + ТекСообщ;
	//	КонецЕсли; 
	//КонецЦикла; 
	
	//0018062	
	//устанавливаем историю, если надо
	Надо = Ложь;
	Если История.Количество() = 0 Тогда
		Надо = Истина;
	Иначе
		ПослСтатус = История[История.Количество()-1].Статус;
		Если НЕ ПослСтатус = Статус Тогда
			Надо = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Если ПредРаботаОККЗавершена<>РаботаОККПоРазногласиямЗавершена Тогда
		Надо = Истина;
	КонецЕсли; 
	Если ПредРаботаЦПБЗавершена<>РаботаЦИРПоРазногласиямЗавершена Тогда
		Надо = Истина;
	КонецЕсли;
	
	Если Надо Тогда
		НовСтр = История.Добавить();
		НовСтр.Дата = ТекущаяДатаСеанса();
		НовСтр.Ответственный = Пользователи.ТекущийПользователь();;
		НовСтр.Статус = Статус;
		
		НовСтр.РаботаЦПБЗавершена = РаботаЦИРПоРазногласиямЗавершена;
		НовСтр.РаботаОККЗавершена = РаботаОККПоРазногласиямЗавершена;
	КонецЕсли; 
	
	НоменклатураСтрокой = Номенклатура;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Утверждение.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УтверждениеНорматива КАК Утверждение
	|ГДЕ
	|	Утверждение.ТребованияККачеству = &Требование
	|	И НЕ Утверждение.ПометкаУдаления
	|	И (Утверждение.Производитель <> &Производитель
	|			ИЛИ Утверждение.Поставщик <> &Поставщик)";
	Запрос.УстановитьПараметр("Требование", Ссылка);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Производитель", Производитель);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из Рез Цикл
		КК = Рез[0].Ссылка.ПолучитьОбъект();
		КК.Поставщик = Поставщик;
		КК.Производитель = Производитель;
		КК.Записать();
		Сообщить("Обновлен документ " + КК.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр НормативыНоменклатурыЛаб
	
	Если Статус = Перечисления.СтатусЗаявки.Согласована Тогда
		Движения.НормативыНоменклатурыЛаб.Записывать = Истина;
		Для Каждого ТекСтрокаПоказатели Из Показатели Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрокаПоказатели.ВидИсследования) Тогда
				Продолжить;
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено(ТекСтрокаПоказатели.Показатель) Тогда
				Продолжить;
			КонецЕсли;		
			
			Движение = Движения.НормативыНоменклатурыЛаб.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Номенклатура;
			Движение.ВидИсследования = ТекСтрокаПоказатели.ВидИсследования;
			Движение.Показатель = ТекСтрокаПоказатели.Показатель;
			Движение.Поставщик = Поставщик;
			Движение.ХарактеристикаНорматива = ТекСтрокаПоказатели.ХарактеристикаНорматива;
			Движение.ВариантСравнения = ТекСтрокаПоказатели.ВариантСравнения;
			Движение.ЕдиницаИзмерения = ТекСтрокаПоказатели.ЕдиницаИзмерения;
			Движение.Значение = ТекСтрокаПоказатели.ЗначениеПоказателяКонечные;
			Движение.Интервал = ТекСтрокаПоказатели.Интервал;
			Движение.наАнглийскомЯзыке = ТекСтрокаПоказатели.ЗначениеПоказателяАнглийский;
			Движение.Лаборатория = ТекСтрокаПоказатели.Лаборатория;
			Движение.Периодичность = ТекСтрокаПоказатели.Периодичность;
			Движение.Комментарий = Комментарий;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

ПредРаботаЦПБЗавершена = Ссылка.РаботаЦИРПоРазногласиямЗавершена; //без ссылки - всегда ложь возвращается
ПредРаботаОККЗавершена = Ссылка.РаботаОККПоРазногласиямЗавершена;
